cf_billing/AccumulationRegisters/энргОбъемНачисленийМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОбъемНачисленийМКД</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемУслугиНорматив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПредоставлены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПредоставленыПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязанаКШкале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СниматьНачисленныйСредний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьМОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьАбонентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьСобственнаяПоставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргНазначениеПУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьУзлаПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргНачисленныйСреднийОбъемМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргНачисленныйСреднийОбъемМКД</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийМКД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргОтложенныеДвиженияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргОтложенныеДвиженияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргРазделыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеНаПрочиеУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргДополнительныеНачисления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатковМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргРазделыЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргРазделыЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Взаиморасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериоды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериодыМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтабильныеПериодыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзаиморасчетыНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеПомещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОбъемНачисленийМКД/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей(ЭтотОбъект,Отказ,Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Регистратор 						= ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ИнициализироватьДополнительныеСвойства(Регистратор);
	
	ЭтоОчистка 							= Ложь;
	Если ДополнительныеСвойства.Свойство("ЭтоОчистка") И ДополнительныеСвойства.ЭтоОчистка Тогда
		ЭтоОчистка 						= Истина;
	КонецЕсли;
	
	Если Не ЭтоОчистка Тогда
		ДобавитьОтложенныеДвижения(Регистратор);
		ДобавитьЗависимыеДанные(Регистратор);
	КонецЕсли; 	
	
	энргНачисления.ЗаписатьНаборыЗаписей(ДополнительныеСвойства.НаборыЗаписей, Замещение);
		
КонецПроцедуры

Процедура ИнициализироватьДополнительныеСвойства(Регистратор)
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора 				= ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДополнительныеСвойства.Вставить("ДатаРегистратора", Регистратор.Дата);
	КонецЕсли;	
	
	Если ДополнительныеСвойства.Свойство("Организация") Тогда
		Организация 					= ДополнительныеСвойства.Организация;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Организация") Тогда
		ДополнительныеСвойства.Вставить("Организация", Регистратор.Организация);
	Иначе
		ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МКД") Тогда
		МКД 							= ДополнительныеСвойства.МКД;
	Иначе
		ДополнительныеСвойства.Вставить("МКД", Неопределено);
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("Район") Тогда
		Район 							= ДополнительныеСвойства.Район;
	ИначеЕсли  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Регистратор,"Район") Тогда
		ДополнительныеСвойства.Вставить("Район", Регистратор.Район);
	Иначе
		ДополнительныеСвойства.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	КонецЕсли;
	
	РазделыЗаписи 							= Новый Массив;
	
	НаборыЗаписей  							= Новый Структура;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргНачислениеМКД") Тогда
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.СтабильныеПериодыМКД, КонецМесяца(ДополнительныеСвойства.ДатаРегистратора)+1));
		РазделыЗаписи.Добавить(Новый Структура("Раздел, ПериодНачисления", Перечисления.энргРазделыЗаписи.РаспределениеМКД, НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора)));
		
		НачисленныйСреднийОбъем 			= РегистрыНакопления.энргНачисленныйСреднийОбъемМКД.СоздатьНаборЗаписей();
		НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
		НачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина);
		
		Если ЗначениеЗаполнено(МКД) И ДополнительныеСвойства.Свойство("ЭтоОчистка") И ДополнительныеСвойства.ЭтоОчистка Тогда
			НачисленныйСреднийОбъем.Прочитать();
			СтрокиУдалить 	= Новый Массив;
			Для Каждого СтрокаНабора ИЗ НачисленныйСреднийОбъем Цикл
				Если НЕ СтрокаНабора.МКД = МКД Тогда
					Продолжить;
				КонецЕсли;				
				СтрокиУдалить.Добавить(СтрокаНабора);
			КонецЦикла;
			
			Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
				НачисленныйСреднийОбъем.Удалить(СтрокиУдалить[Сч]);
			КонецЦикла;
			
		КонецЕсли;
	
		НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 	НачисленныйСреднийОбъем);		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.энргПерерасчетМКД") Тогда 
		Если ДополнительныеСвойства.Свойство("НаборНачисленныйСредний") Тогда
			НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 	ДополнительныеСвойства.НаборНачисленныйСредний);
		Иначе
			НачисленныйСреднийОбъем 			= РегистрыНакопления.энргНачисленныйСреднийОбъемМКД.СоздатьНаборЗаписей();
			НачисленныйСреднийОбъем.Отбор.Регистратор.установить(Регистратор);
			НачисленныйСреднийОбъем.ДополнительныеСвойства.Вставить("ЗаписьРазрешена", Истина); 
			
			Если ЗначениеЗаполнено(МКД) И ДополнительныеСвойства.Свойство("ЭтоОчистка") И ДополнительныеСвойства.ЭтоОчистка Тогда
				НачисленныйСреднийОбъем.Прочитать();
				СтрокиУдалить 	= Новый Массив;
				Для Каждого СтрокаНабора ИЗ НачисленныйСреднийОбъем Цикл
					Если НЕ СтрокаНабора.МКД = МКД Тогда
						Продолжить;
					КонецЕсли;				
					СтрокиУдалить.Добавить(СтрокаНабора);
				КонецЦикла;
				
				Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
					НачисленныйСреднийОбъем.Удалить(СтрокиУдалить[Сч]);
				КонецЦикла;
				
			КонецЕсли;
			
			НаборыЗаписей.Вставить("энргНачисленныйСреднийОбъем", 	НачисленныйСреднийОбъем);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РазделыЗаписи", РазделыЗаписи);	
			
	Если РазделыЗаписи.Количество() > 0 Тогда
		НаборОтложенныеДвижения 			= РегистрыСведений.энргОтложенныеДвиженияДокументов.СоздатьНаборЗаписей();
		НаборОтложенныеДвижения.Отбор.ДокРегистратор.Установить(Регистратор);
		НаборОтложенныеДвижения.ДополнительныеСвойства.Вставить("ЗамещатьОтложенныеДвижения", Истина);
		НаборыЗаписей.Вставить("энргОтложенныеДвиженияДокументов", 		НаборОтложенныеДвижения);				
	КонецЕсли;
			
	ДополнительныеСвойства.Вставить("НаборыЗаписей", НаборыЗаписей);
	
КонецПроцедуры

Процедура ДобавитьОтложенныеДвижения(Регистратор)
	перем НаборОтложенныеДвижения;
	
	НаборыЗаписей 							= ДополнительныеСвойства.НаборыЗаписей;
	
	Если Не НаборыЗаписей.Свойство("энргОтложенныеДвиженияДокументов", НаборОтложенныеДвижения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.МКД = Неопределено Тогда 
		мМКД  								= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЭтотОбъект.ВыгрузитьКолонку("МКД"));
	Иначе
		мМКД 								= Новый Массив;
		мМКД.Добавить(ДополнительныеСвойства.МКД);
	КонецЕсли;	
	
	РазделыЗаписи 							= ДополнительныеСвойства.РазделыЗаписи;
	СтабильныеМКД							= Перечисления.энргРазделыЗаписи.СтабильныеПериодыМКД;	
	Для Каждого СтрокаРаздела Из РазделыЗаписи Цикл	
		Если СтрокаРаздела.Раздел = СтабильныеМКД Тогда 
			НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
			НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
			НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
			НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
			НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
			НоваяЗапись.ДокРегистратор 		= Регистратор;
			НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;
			НоваяЗапись.ЧастныйСектор 		= Ложь;
			НоваяЗапись.Строение 			= Справочники.энргСтроения.ПустаяСсылка();
		Иначе
			Для Каждого МКД Из мМКД Цикл
				НоваяЗапись 					= НаборОтложенныеДвижения.Добавить();
				НоваяЗапись.Организация		 	= ДополнительныеСвойства.Организация;
				НоваяЗапись.ПериодНачисления 	= СтрокаРаздела.ПериодНачисления;
				НоваяЗапись.Район 				= ДополнительныеСвойства.Район;
				НоваяЗапись.РазделЗаписи 		= СтрокаРаздела.Раздел;
				НоваяЗапись.ДокРегистратор 		= Регистратор;
				НоваяЗапись.ДатаРегистратора 	= ДополнительныеСвойства.ДатаРегистратора;
				НоваяЗапись.ЧастныйСектор 		= Ложь;
				НоваяЗапись.Строение 			= МКД;
			КонецЦикла;			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗависимыеДанные(Регистратор) 
	перем НачисленныйСредний;
	
	НаборыЗаписей 							= ДополнительныеСвойства.НаборыЗаписей;
	
	Если НЕ НаборыЗаписей.Свойство("энргНачисленныйСреднийОбъем", НачисленныйСредний) Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ДополнительныеСвойства.Свойство("МКД")) Тогда
	//	МКД = ДополнительныеСвойства.МКД;
	//	НачисленныйСредний.Прочитать();
	//	СтрокиУдалить 										= Новый Массив;
	//	Для Каждого СтрокаНабора ИЗ НачисленныйСредний Цикл
	//		Если НЕ СтрокаНабора.МКД = МКД Тогда
	//			Продолжить;
	//		КонецЕсли;				
	//		СтрокиУдалить.Добавить(СтрокаНабора);
	//	КонецЦикла;
	//	
	//	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
	//		НачисленныйСредний.Удалить(СтрокиУдалить[Сч]);
	//	КонецЦикла;
	//	
	//КонецЕсли;
		
	ВидОперацииПоСреднему  					= Перечисления.энргСпособНачислений.НачислениеПоСреднему;
	ВидОперацииПоСреднемуНормативу 			= Перечисления.энргСпособНачислений.СреднееПоНормативу;
	
	Для Каждого Строка Из ЭтотОбъект Цикл		
		Если (Строка.СпособНачисления = ВидОперацииПоСреднему Или Строка.СпособНачисления = ВидОперацииПоСреднемуНормативу)
			и Строка.СниматьНачисленныйСредний
			и Строка.ОбъемУслуги > 0 Тогда
			Запись  						= НачисленныйСредний.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Запись,Строка);
			Запись.ПериодНачисления 		= НачалоМесяца(ДополнительныеСвойства.ДатаРегистратора);
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры
